espressif/esp-idf/components/esp_eth/test_apps/test_app_driver/sdkconfig.ci.rmii_clko_esp32p4v1
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

CONFIG_UNITY_ENABLE_FIXTURE=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ESP_TASK_WDT_EN=n

# interface configuration
CONFIG_ETHERNET_INTERNAL_SUPPORT=y
CONFIG_ETHERNET_PHY_GENERIC=y
CONFIG_ETHERNET_DEFAULT_EVENT_HANDLER=n

CONFIG_ETHERNET_PHY_INTERFACE_RMII=y
CONFIG_ETHERNET_RMII_CLK_OUTPUT=y
CONFIG_ETHERNET_RMII_CLK_EXT_LOOPBACK_EN=y
# Test board needs to be modified!
# Connect GPIO23 to GPIO32 via wire.
CONFIG_ETHERNET_RMII_CLK_GPIO=23
CONFIG_ETHERNET_RMII_CLK_EXT_LOOPBACK_IN_GPIO=32
